######################################
#      Groupby WORKSHOP
######################################

#1.city 테이블에서 중복을 제거한 유일한 CountryCode 의 목록을 조회하세요. 
# 힌트: distinct


#2.city 테이블에서 인구수(Population)를 내림차순으로 정렬하여 상위 10개를 출력하세요. 


#3. city 테이블에서 CountryCode별 인구의 최대값을 조회하세요. 




#4. city 테이블에서 CountryCode별 평균 인구수를 조회하세요. 



#5. city 테이블에서 도시의 개수를 출력하세요. 



#6.city 테이블에서 국가코드(CountryCode)별로 최대 인구수가 1000000 명이상인 
# 인구를 가진 국가코드(CountryCode)와 최대 인구수를 조회하세요.  
# Having 




# city 테이블에서 국가코드별, 도시명(Name)별 그룹바이 하여,  
# 국가코드, 도시명, 합산 인구수를 출력하세요. 
# ROLLUP을 이용하여 중간 집계 결과를 출력하세요.  



